export const state = () => ({
  name: "Кудашев Тимур",
  city: "Набережные Челны",
  date: "25 июня 1992",
  status: "Ищу работу Frontend разработчиком VueJS, NuxtJS",
  emailvalue: "ktr992@yandex.ru",
  phonevalue: '89869108073',
  tgvalue: '//tttttt.me/ktr992',
  description: 'Опыт адаптивной кроссбраузерной верстки сайтов более 6 лет. Опыт Frontend разработки Vue JS небольшой, но это направление, в котором я активно развиваюсь. Также развиваюсь в направлении Fullstack разработки на NuxtJS. Занимаюсь улучшением знаний английского языка. Имею опыт работы как в команде, так и удаленно.',
  skills: [
    { type: 'info', label: 'HTML' },
    { type: 'info', label: 'CSS' },
    { type: 'info', label: 'SCSS' },
    { type: 'info', label: 'Javascript' },
    { type: 'info', label: 'jQuery' },
    { type: 'info', label: 'VueJS' },
    { type: 'info', label: 'NuxtJS' },
    { type: 'info', label: 'MongoDB' },
    { type: 'info', label: 'Figma' },
    { type: 'info', label: 'Photoshop' },
   
  ],
  skills2: [
    { type: 'info', label: 'Typescript' },
    { type: 'info', label: 'Webpack' },
    { type: 'info', label: 'C++' },
    { type: 'info', label: 'Python' },
    { type: 'info', label: 'Matlab' },
    { type: 'info', label: 'SQL' },
    { type: 'info', label: 'CMS Opencart' },
    { type: 'info', label: 'CMS Diafan' },
    { type: 'info', label: 'SEO' },
  ],
  langs: [
    { type: 'info', label: 'Английский' },
    { type: 'info', label: 'Французский' },
  ],
  experience: [
    {
      date: '2010 - 2015',
      title: 'Филиал Казанского (Приволжского) федерального университета, Набережные Челны',
      description: 'Прикладная математика и информатика (математик, системный программист)',
      role: 'Специалист',
      status: 'past',
      id: '001'
    },
    {
      date: '2015 - 2018',
      title: 'VELVETMEDIA, веб-студия г. Набережные Челны',
      description: 'Верстка HTML CSS JS. Интеграция сайтов на CMS Diafan, Wordpress. Оптимизация, поддержка работы сайтов. Выполнение всего комплекса работ по технической части.',
      role: 'Верстальщик, программист',
      status: 'past',
      id: '002'
    },
    {
      date: '2018',
      title: 'Фриланс, разработка собственных проектов',
      description: 'Верстка и другие виды работ на фрилансе - <a href="//www.fl.ru/users/ktr992/portfolio/#/" target="_blank">ссылка на фриланс профиль</a>',
      role: 'Верстальщик, программист',
      status: 'past',
      id: '003'
    },
    {
      date: '2018 - н.в.',
      title: 'ООО "Эмпис", интернет-агентство полного цикла, г.Москва (удаленно) - <a href="//www.empis.ru" target="_blank">empis.ru</a> ',
      description: 'Верстка сайтов и задачи по Frontend разработке JS. Выполнение всего комплекса задач по Frontend части.',
      role: 'Верстальщик, Frontend-разработчик',
      status: 'present',
      id: '004'
    },
  ],
  about: `<div>
    <p>Здесь представлена некоторая часть моих работ. Это не весь мой опыт. Остальное либо утеряно, либо является частью веб-проектов и не поддается демонстрации. Также сюда не добавлены неитересные проекты, такие как сайты на WordPress, типовые лендинги и т.п. </p>
    <p>Все эти проекты являются реальными задачами, и никакой из них не был реализован в учебных или демонстрационных целях. Те проекты, у которых есть ссылка на сайт, могли существенно видоизмениться без моего участия. Эти ссылки даны здесь лишь для подтверждения того, что данные разработки были использованы на реальных веб-проектах. Актуальный на момент разработки вариант по ссылке "Демо".</p>
    <p>Справа от названия указаны некоторые из технологий, использованных при разработке.</p>
    <p>Проекты выполнялись в строго установленные сроки и преимущественно по утвержденным макетам. Предоставлено все как есть на момент реализации.</p>
  </div>`

})

